"""

Перевірити справедливість рівності при заданій точності ε :
ln(1+x)=[x-(x**2)/2+(x**3)/3-(x**4)/4+...+((-1)**(n-1))*(x**n)/n+...] xє(-1;1)

"""
# позначення
'''
x - float змінна
n - int номер доданка
Sum=ln(1+x) - результат
epsylon - задана точність
'''
import math as c
# введення

x = float(input('Введіть значення хє(-1;1) :'))
n = int(input('Введіть значення n :'))
epsylon = float(input("Задайте точність ε :"))
Sum = 0
# перевірка
for i in range(1,n):
    Sum += ((-1)**(i-1))*(x**i)/i
if abs(c.log10(1+x)-Sum) <= epsylon :
    print('Сраведливість виконується.')
else:
    print('Сраведливість не виконується.')